# vstSetCustomProc

## Description
```pascal
PROCEDURE vstSetCustomProc(inRoutineName : STRING);
```

```python

def vs.vstSetCustomProc(inRoutineName):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inRoutineName|STRING||

## Version
Availability: from Vectorworks 2011
## Category
* Tool Events